load-tests/load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: "https://httpbin.org"
  phases:
    - duration: 30
      arrivalRate: 10
      name: Phase 1 - 10 VU/s for 30 seconds
    - duration: 30
      arrivalCount: 100
      name: Phase 2 - 100 VU over 30 seconds (approx. 3VU/s)
    - duration: 30
      arrivalRate: 10
      rampTo: 200
      name: Ramp up load - linear growth (approx. 6VU/s)
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 500
  ensure:
    thresholds:
      - http.response_time.p99: 1200
      - http.response_time.p95: 750
scenarios:
  - flow:
      - loop:
          - get:
              url: '/basic-auth/foo/bar'
              auth:
                user: foo
                pass: bar
        count: 1
      - loop:
          - get:
              url: '/basic-auth/foo/bar'
              auth:
                user: wrong
                pass: credentials
        count: 1