load-tests/playwright-load.yml
config:
  target: "https://google.com"
  engines:
    playwright: {}
  processor: './load-scenario.ts'
  phases:
    - duration: 3
      arrivalRate: 10
      name: Phase 1 - 10 VU/s for 30 seconds - 300 VU total
    - duration: 3
      arrivalCount: 100
      name: Phase 2 - 100 VU total over 30 seconds (approx. 3VU/s)
    - duration: 3
      arrivalRate: 10
      rampTo: 200
      name: Ramp up load - linear growth (approx. 6VU/s) - (10+200)/2= 105VU/s * 30  = 3150 VU total
  plugins:
    expect: {}
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 500
  ensure:
    thresholds:
      - http.response_time.p99: 1200
      - http.response_time.p95: 750
scenarios:
  - engine: playwright
    testFunction: 'playwrightTest'